TesboCFD/tutorials/incompressible/pimpleFoam/laminar/sloshing2D/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

if ! canCompile
then
    echo "skipping tutorial $PWD"
    exit 0
fi

restore0Dir

runApplication blockMesh

runApplication makeFaMesh

(cd makeWave && wmake)

runApplication makeWave

runApplication $(getApplication)

#------------------------------------------------------------------------------
